blog/learning-rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-16 Tue 10:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Rust: The Pick-Up Sticks Game</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Learning Rust: The Pick-Up Sticks Game</h1>
<div id="outline-container-org0a67b1f" class="outline-2">
<h2 id="org0a67b1f"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This <a href="https://github.com/tvraman/pick-sticks">directory</a> contains an implementation of the <i>Pick Up Sticks</i> game
described in my paper <a href="http://emacspeak.sourceforge.net/raman/publications/thinking-of-math/thinking-of-math.html">Thinking Of Mathematics (Section 5)</a>.
</p>

<p>
It's an interesting experience writing it in Rust as I learn the
language. The original implementation described in my paper was
written in 1987 in Fortran-77, and consisted of one single
function. Though that style of programming would be frowned upon today
and is clearly not advisable for programming in the large, it's
interesting to observe that a more structured implementation as seen
in this Rust implementation qrequires a lot more fore-thought with
respect to code organization.
</p>
</div>
</div>

<div id="outline-container-org8a0d2da" class="outline-2">
<h2 id="org8a0d2da"><span class="section-number-2">2</span> Programming Environment</h2>
<div class="outline-text-2" id="text-2">
<p>
here is a short overview of  the programming environment  used:
</p>

<ol class="org-ol">
<li>Emacs 28.0.50 with emacspeak 52.0.</li>
<li>Package  <code>eglot</code> for managing the project with an  LSP server.</li>
<li>Rust Language Server <a href="https://github.com/rust-lang-nursery/rls">(RLS)</a> as the LSP server.</li>
<li>Package <code>company</code> for completion.</li>
<li>Package <code>yasnippet</code> for code templates.</li>
<li>Package <code>rust-mode</code> for Rust editing smarts.</li>
<li>Package <code>racer</code> for additional cross-referencing and
documentation support.</li>
<li>Package <code>cargo</code> for cargo integration from inside Emacs.</li>
</ol>

<p>
In the process of setting up my Rust environment, I also
speech-enabled Emacs packages <code>rust-mode</code>, <code>racer</code> and <code>cargo</code> for Emacspeak.
</p>
</div>
</div>


<div id="outline-container-org6572a3a" class="outline-2">
<h2 id="org6572a3a"><span class="section-number-2">3</span> Books</h2>
<div class="outline-text-2" id="text-3">
<p>
I  downloaded  <i>The Rust Programming Language (2018)</i> from Bookshare
and it's what I am still using as I write this. Note that this book is
also available in the Rust distribution. The version in the Rust
distribution is a little less usable since it's split into multiple
smaller HTML files with each file repeating a lot of navigational
boiler-plate at the top.
</p>
</div>
</div>

<div id="outline-container-org2e40623" class="outline-2">
<h2 id="org2e40623"><span class="section-number-2">4</span> Experience Learning Rust</h2>
<div class="outline-text-2" id="text-4">
<p>
I usually find that I learn a language better if I write some code as
I learn the language.
In this instance, I decided to program the pick-up-sticks game &#x2014; a
simple game that I programmed in 1987 for the final class project for
CS-101 at IIT-Bombay. Here are the rules of the game:
</p>

<ol class="org-ol">
<li>This is a two-player game  and the game starts with \(n\) sticks.</li>
<li>The first player can pick at most \(n-1\)  sticks.</li>
<li>Assume a player picks \(k\) sticks. At the  subsequent turn, opponent
can pick at most  \(2 * k\) sticks.</li>
<li>The player who is able to <i>clean-up</i> the remaining sticks while
adhering to the rules is the winner.</li>
</ol>

<p>
Read  <a href="http://emacspeak.sourceforge.net/raman/publications/thinking-of-math/thinking-of-math.html">Thinking Of Mathematics (Section 5)</a> for a description of an
algorithm that is guaranteed to win.
</p>
</div>
</div>

<div id="outline-container-orge266a0f" class="outline-2">
<h2 id="orge266a0f"><span class="section-number-2">5</span> The Implementation</h2>
<div class="outline-text-2" id="text-5">
<p>
Learning Rust's ownership rules for memory management, and learning to
use references  the Rust way were some of the things that were unique
to this learning experience.
Rust has some unique features including declaring lifetimes that are
typically needed in more advanced cases; however in my initial
attempts, not doing things the Rust way caused compile-time errors
that initially guided me toward using and declaring
lifetimes. Eventually, all of those declarations became unnecessary.
More generally, the Rust compiler turns out to be a very good Rust
teacher.
</p>
</div>
</div>

<div id="outline-container-orgda356e2" class="outline-2">
<h2 id="orgda356e2"><span class="section-number-2">6</span> Crux Of The Implementation</h2>
<div class="outline-text-2" id="text-6">
<p>
See module <code>game.rs</code> for the implementation. The core of the
implementation is still a handful of lines to implement the winning
strategy of:
</p>

<ol class="org-ol">
<li>If the number of sticks at the start is a Fibonacci number, ask
the opponent to play first.</li>
<li>At each turn, force the opponent toward the closest Fibonacci number.</li>
<li>Do above while respecting the limit rule, i.e. if you pick \(k\)
sticks, the opponent can pick up to \(2k\) sticks, so never pick  \(k\)
where \(3k >= n\).</li>
<li>The result of (3) is to subdivide the game into smaller games
when playing with larger values of \(n\) &#x2014; see the <span class="underline">while</span> loop in
method    <code>my_move</code>.</li>
</ol>
</div>
</div>
<div id="outline-container-org66df065" class="outline-2">
<h2 id="org66df065"><span class="section-number-2">7</span> Closing Thoughts</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>The computing environment I now have is far more sophisticated
than what I had in 1987.</li>
<li>Today, I have interactive completion, source-code
cross-references, on-the-fly access to documentation, and a fully
accessible book where I can look up things whenever I want.</li>
<li>In 1987, I did most of my thinking and problem-solving in my
dorm-room with no computer to hand. When ready with the solution,
I made a few notes in Braille using a <a href="https://www.google.com/search?num=25&amp;lite=90586&amp;q=braille+pocket+slate">pocket-slate and stylus</a>,
then went to the computer room with a volunteer reader and typed
up the program, with the student volunteer providing high-quality
interactive spoken feedback.</li>
<li>Interestingly, I think it took me less time  from memory to
implement the solution in 1987 &#x2014; perhaps this is time shrinking
with number of years passed.</li>
<li>Either way, the primary take-away is that it pays to analyse a
problem before one actually starts writing code. Writing code is
always fun, and today, even more so given the excellent array of
tools &#x2014; but unless one focuses on the problem at hand, one can
spend a lot of time <i>sharpening one's pencils</i> as opposed to
writing something useful.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-06-14 Sun 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-06-16 Tue 10:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
